def area(a, b):
'''
    Возвращает площадь прямоугольника по двум его сторонам.
    
        Параметры:
            a (int): Длина прямоугольника
            b (int): Ширина прямоугольника

        Возвращаемое значение:
            rectangleArea (int): Площадь прямоугольника сторон a и b
    
'''    
return a * b 

def perimeter(a, b):
'''
    Возвращает периметр прямоугольника по двум его сторонам.
    
        Параметры:
            a (int): Длина прямоугольника
            b (int): Ширина прямоугольника

        Возвращаемое значение:
            rectanglePerimeter (int): Периметр прямоугольника сторон a и b
    
'''        
return (a + b) * 2 
