
def area(a):
    '''
    Возвращает площадь квадрата по его стороне.
    
        Параметры:
            a (int): Сторона квадрата
            
        Возвращаемое значение:
            squareArea (int): Площадь квадрата стороны a
    
    '''    
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата по его стороне.
    
        Параметры:
            a (int): Сторона квадрата
            
        Возвращаемое значение:
            squarePerimeter (int): Периметр квадрата стороны a
    
    '''        
    return 4 * a
